{
  "content": "<h1 id=\"flow-handling\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#flow-handling\">#</a>Flow Handling</h1>\n<blockquote>\n<p>Flow is the definition of handlers around states a webpage can exist, and controls to restore your desired scraper script state.</p>\n</blockquote>\n<p>Often while building a scraper script, the script is built to handle the \"clean path\". This path does not handle situations where a website asks you to reduce traffic requests, or has prompted for a cookie consent agreement. We found that it can be quite challenging to program around these scenarios in a clean way.</p>\n<h3 id=\"flow-handlers\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#flow-handlers\">#</a>Flow Handlers</h3>\n<p>To that end, FlowHandlers were created. FlowHandlers allow you to define a \"State\" that the page can be in, and a \"Resolver\" to correct the state and resume your \"clean path\". Because these are outlier paths, the expectation is that FlowHandlers will click the consent button and resume, or redirect back to the page you wish to be on (if you've been sent to another page).</p>\n<pre class=\"ulixeeTheme\"><code class=\"language-js\">await hero.registerFlowHandler('CookieModal', assert => {\n  assert(hero.querySelector('#cookie-modal').$isVisible);\n},\nasync error => {\n  await hero.querySelector('#cookie-modal .dismiss').$click();\n});\n</code></pre>\n<p>NOTE: If the \"flow\" cannot be resumed, a FlowHandler should throw an error to indicate to a \"controlling\" process how to retry the activity.</p>\n<h3 id=\"when-a-flow-handler-will-trigger\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#when-a-flow-handler-will-trigger\">#</a>When a Flow Handler will Trigger</h3>\n<p>FlowHandlers are automatically checked anytime an AwaitedDOM error occurs. These errors are things like: an element can't be found, an element interaction failed, or waiting for an element <a href=\"/docs/hero/advanced-client/tab#wait-for-state\">State</a> timed out.</p>\n<h3 id=\"flow-commands\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#flow-commands\">#</a>Flow Commands</h3>\n<p><a href=\"/docs/hero/advanced-client/tab#flow-commands\">FlowCommands</a> are ways to group a series of commands together that should be re-run as a unit when an AwaitedDOM error occurs. This is often useful in more complicated Flow scenarios: eg, where a Form validation has failed that requires re-typing information for an autocomplete list, or the Tab has redirected to an error page and the flow needs to restart. You would want to ensure all steps are run when a failure is encountered.</p>\n<pre class=\"ulixeeTheme\"><code class=\"language-js\">await hero.flowCommand(async () => {\n  await hero.querySelector('#field1').$click();\n  await hero.querySelector('#field1').$clearInputText();\n\n  // Failure here resumes the entire block once a FlowHandler fixes the state\n  await hero.querySelector('#field1').$type('value');\n});\n</code></pre>\n<p>Flow Commands can be nested within each other. If nested commands cannot be completed due to AwaitedDOM errors (interactions, dom errors, dom state timeouts), they will trigger the outermost block to be re-tried.</p>",
  "title": "Flow Handling",
  "subtitles": [
    {
      "depth": 3,
      "value": "Flow Handlers",
      "anchor": "#flow-handlers"
    },
    {
      "depth": 3,
      "value": "When a Flow Handler will Trigger",
      "anchor": "#when-a-flow-handler-will-trigger"
    },
    {
      "depth": 3,
      "value": "Flow Commands",
      "anchor": "#flow-commands"
    }
  ]
}