{
  "content": "<h1 id=\"ulixee-skademlia-distributed-hash-table\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#ulixee-skademlia-distributed-hash-table\">#</a>Ulixee s/Kademlia Distributed Hash Table</h1>\n<p>Ulixee Clouds use a distributed hash table that uses the s/kademlia (kad) specification for discovery of nodes and \"providers\" (or host-ers) of Datastores throughout the network.</p>\n<h2 id=\"what-is-a-distributed-hash-table\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#what-is-a-distributed-hash-table\">#</a>What is a Distributed Hash Table?</h2>\n<p>A distributed hash table (or DHT) is a lookup table for nodes and data that can run across a number of unrelated (or decentralized) nodes. These nodes are able to use the DHT to content and other nodes throughout a network without any central locator table.</p>\n<p>A DHT works by using each Node's \"nodeId\" to find the \"closest\" nodeIds in the network to a given key or sha256 of a nodeId. This \"closeness\" is determined using an \"xor\" of the bits of two different buffers. Nodes keep track \"buckets\" of ids starting with different prefixes. When a node needs to find content (a sha256 hash of the content) in the network, it finds the nodeIds closest to the content hash and then asks each of those nodes if it knows the given content \"provider\" or any closer nodes. This process repeats for the closer nodes until the content is found (or no closer options are available).</p>\n<h2 id=\"network-identities-nodeids\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#network-identities-nodeids\">#</a>Network Identities (NodeIds)</h2>\n<p>The secure (s) part of Kademlia is provided by using nodeIds that are encoded ED25519 keypairs. The routing table sorts these nodeIds as sha256 of their public key bytes. This provides cryptographic randomization to prevent attacks on the network where simulated ids try to corner off lookups of certain values. Nodes must provide their public key and verify they own them during the initial <code>Kad.connect/Kad.verify</code> handshake.</p>\n<p>*Bech32m is a specification created for Bitcoin that encodes a buffer into a Base32 encoding with a checksum to avoid mistyping keys.</p>\n<h2 id=\"bootstrapping\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#bootstrapping\">#</a>Bootstrapping</h2>\n<p>Nodes must have at least 1 bootstrap node (<code>host/nodeId</code>) to connect to. The initial node(s) will be used to seed a Routing Table containing a distribution of nodeIds across the network containing various \"prefixes\".</p>\n<h2 id=\"protocol\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#protocol\">#</a>Protocol</h2>\n<p>The Ulixee Kad works by attaching to an http/s server and communicating over JSON websockets. JSON is serialized with typing information.</p>\n<h2 id=\"usage\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#usage\">#</a>Usage</h2>\n<p>This API is not meant to be used outside of a CloudNode. You can start a CloudNode with the following properties to activate the service:</p>\n<ul>\n<li>cloudType: <code>private | public</code>. A public node will automatically enable the kad.</li>\n<li>networkIdentity: <code>Identity</code>. The KAD network identity to use to verify this node id.</li>\n<li>kadEnabled <code>boolean</code>. Must be set to true to activate the kad. Will default to true if this node is registered as <code>cloudType: public</code>.</li>\n<li>kadDbPath <code>string</code>. The KAD database path where NodeInfo and Providers will be stored.</li>\n<li>kadBootstrapPeers <code>string[]</code>. Peers to connect to to build routing tables. These must include a host, and can optionally include a nodeId (<code>host/nodeId</code>) for security.</li>\n</ul>",
  "title": "Ulixee s/Kademlia Distributed Hash Table",
  "subtitles": [
    {
      "depth": 2,
      "value": "What is a Distributed Hash Table?",
      "anchor": "#what-is-a-distributed-hash-table"
    },
    {
      "depth": 2,
      "value": "Network Identities (NodeIds)",
      "anchor": "#network-identities-nodeids"
    },
    {
      "depth": 2,
      "value": "Bootstrapping",
      "anchor": "#bootstrapping"
    },
    {
      "depth": 2,
      "value": "Protocol",
      "anchor": "#protocol"
    },
    {
      "depth": 2,
      "value": "Usage",
      "anchor": "#usage"
    }
  ]
}