{
  "content": "<h1 id=\"close-argon-blocks\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#close-argon-blocks\">#</a>Close Argon Blocks</h1>\n<blockquote>\n<p>Your Localchain will automatically convert your settled micropayments into Argon Block votes, and you'll close some blocks! Find out here how to set it up.</p>\n</blockquote>\n<h2 id=\"background\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#background\">#</a>Background</h2>\n<p>Ulixee uses the Argon currency for Micropayments. When a datastore consumer runs a query, they will lock their Localchain with a set amount of Argons - this is called a Micropayment ChannelHold. Payment is now settled in tiny increments between the datastore and user. Once complete, the Datastore will send the Settled ChannelHold note to a notary and the Argon network.</p>\n<p>Argon is a blockchain that uses proof of \"work\" to close blocks. However, in this case the work is the Datastore queries that you just served to users. Proof of work is supplied in the form of tax revenue from Datastore Micropayments, which are able to be converted into a \"vote\" on which block to close. If your vote is chosen, you get a portion of the rewards for closing the block.</p>\n<p>Argon requires a tax on all transactions, which it uses to stabilize its value. For transactions over 1 Argon, this is set to ~20 cents (0.2 argons). For any micropayments (under 1 Argon), it is only 20% of the transaction value. So as your users pay for queries, you're actually automatically collecting a tax that you can use to close Argon blocks.</p>\n<h2 id=\"closing-blocks\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#closing-blocks\">#</a>Closing Blocks</h2>\n<p>When you setup your Datastore for payments, you'll configure the Argon Localchain that your Datastore will use. You'll also choose a specific Argon Miner that you believe is an honest operator.</p>\n<p>Your Localchain collects payments and automatically claims the appropriate amount of tax when it settles with your chosen Argon Notary (<code>ARGON_NOTARY_ID</code>).</p>\n<p>The Localchain can be setup to automatically create block votes if you set an <code>ARGON_BLOCK_REWARDS_ADDRESS</code> in your env, or you set it using the <code>@ulixee/cloud</code> command line. The Localchain will create votes with a strategy of voting anytime your collected tax exceeds the minimum vote threshold.</p>\n<p>NOTE: you can code a more sophisticated strategy if you want to change this process. The code for creating votes can be currently traced in the Argon Mainchain codebase in <a href=\"https://github.com/argonprotocol/mainchain/blob/416812ac0c905295dcf76472a68bee16d02e5f3c/localchain/src/balance_sync.rs#L508\">Localchain/src/balance_sync.rs</a>. A new strategy doesn't have to be in rust. There's a nodejs library to interact with the mainchain <code>@argonprotocol/mainchain</code>, as well as node interaction with the notary and localchain at <code>@argonprotocol/localchain</code>. You'll find uses of that library in this [project](.</p>\n<h2 id=\"securing-you-block-rewards-address\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#securing-you-block-rewards-address\">#</a>Securing you Block Rewards Address</h2>\n<p>Your block rewards account does not need to have a Localchain yet (you can always create one later that attaches to this private key). For that reason, you should generate your block rewards address, but only create a key. You should have a seed phrase and an account address once you're done. Do not publish the seed phrase to any CloudNode or anything public (like a code repository). This will separate your block rewards from your Localchain account - kind of like automatically depositing them into a more secure vault.</p>\n<p>NOTE: In a production environment, you would create these with a hardware wallet or a secure offline computer.</p>\n<p>For the Testnet, it's perfectly valid to follow the online Polkadot.js process to create an account <a href=\"https://github.com/argonprotocol/mainchain/blob/3a4bfab8cb296b85da0543d577a2a33e85b83b54/docs/account-setup.md\">here</a> or even reuse your Localchain account if you don't want to bother with this step.</p>\n<h2 id=\"watching-for-closed-blocks\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#watching-for-closed-blocks\">#</a>Watching for Closed Blocks</h2>\n<p>You can watch for closed blocks by listening to the Argon Mainchain. You can use the <code>@argonprotocol/mainchain</code> library to listen for new blocks and check if your vote was chosen. If your vote was chosen, you'll receive a reward in the form of Argons.</p>\n<p>To monitor for blocks using your address, you could do something like this:</p>\n<pre class=\"ulixeeTheme\"><code class=\"language-typescript\">import { getClient } from '@argonprotocol/mainchain';\n\nconst client = await getClient(`wss://rpc.testnet.argonprotocol.org`);\nconst eventMetadata = client.events.blockRewards.RewardCreated.meta;\nconst rewardsIndex = eventMetadata.fields.findIndex(x => x.name.toString() === 'rewards');\nconst unsub = mainchainClient.rpc.chain.subscribeNewHeads(async lastHeader => {\n  const blockHash = lastHeader.hash.toHex();\n  const blockNumber = lastHeader.number.toNumber();\n\n  const events = await mainchainClient.query.system.events.at(blockHash);\n  for (const { event } of events) {\n    if (event.section === 'blockRewards' &#x26;&#x26; event.method === 'RewardCreated') {\n      const rewards = event.data[rewardsIndex].toJSON();\n      for (const reward of rewards) {\n        if (reward.accountId == '5DtCHcwuh7Mhp8cZtvinxDzSa36rh7m3TG9LFo3Tgxuyx889') {\n          console.log(`You closed a block! (${blockNumber}: ${blockHash})`, JSON.stringify(reward));\n        }\n      }\n    }\n  }\n});\n</code></pre>\n<p>Or you can use the Argon <a href=\"https://polkadot.js.org/apps/?rpc=wss%3A%2F%2Frpc.testnet.argonprotocol.org#/explorer\">developer console</a> UI to watch for your rewards (this is a common utility built by Polkadot, which produces the Substrate framework that Argon is built on top of. You should see a BlockRewards event with your address if you closed a block.</p>\n<p><img src=\"../images/pjs-block-explorer.png\" alt=\"Polkadot.js - Block Explorer\"></p>",
  "title": "Close Argon Blocks",
  "subtitles": [
    {
      "depth": 2,
      "value": "Background",
      "anchor": "#background"
    },
    {
      "depth": 2,
      "value": "Closing Blocks",
      "anchor": "#closing-blocks"
    },
    {
      "depth": 2,
      "value": "Securing you Block Rewards Address",
      "anchor": "#securing-you-block-rewards-address"
    },
    {
      "depth": 2,
      "value": "Watching for Closed Blocks",
      "anchor": "#watching-for-closed-blocks"
    }
  ]
}